uhnp/src/Catalogs/ФиксированныеСчетаУчетаБД/ФиксированныеСчетаУчетаБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФиксированныеСчетаУчетаБД</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВнеоборотныеАктивы</name>
      <description>Внеоборотные активы</description>
    </items>
    <items>
      <name>КонсолидационныеПоправки</name>
      <description>Консолидационные поправки</description>
    </items>
    <items>
      <name>НераспределеннаяПрибыль</name>
      <description>Нераспределенная прибыль</description>
    </items>
    <items>
      <name>ОбщиеВспомогательныеСчета</name>
      <description>Общие вспомогательные счета</description>
    </items>
    <items>
      <name>ОтложенныеНалоги</name>
      <description>Отложенные налоги</description>
    </items>
    <items>
      <name>РезервыПоПретензиям</name>
      <description>Резервы по претензиям</description>
    </items>
    <items>
      <name>РеформацияБаланса</name>
      <description>Реформация баланса</description>
    </items>
    <items>
      <name>РеформацияСебестоимости</name>
      <description>Реформация себестоимости</description>
    </items>
  </predefined>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Documents/УчетнаяПолитикаМСФО/УчетнаяПолитикаМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетнаяПолитикаМСФО</name>
  <posting>Deny</posting>
  <attributes>
    <name>ВалютаИсточник</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовУчета</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаИсточникДоп</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУчетаДоп</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимТрансформационнойКорректировки</name>
    <type>
      <types>EnumRef.РежимКорректировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТрансляции</name>
    <type>
      <types>CatalogRef.ШаблоныТрансляций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогСущественностиВНА</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогПризнанияАренды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособТрансляции</name>
    <type>
      <types>EnumRef.СпособыТрансляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДляЧистойЦеныПродажиЗапасов</name>
    <type>
      <types>DefinedType.ТипЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаОтложенногоНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПриИзмененииВЗакрытомПериоде</name>
    <type>
      <types>EnumRef.ДействияПриИзмененииВЗакрытомПериодеМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦен</name>
    <type>
      <types>CatalogRef.ВидыКотировокФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>БезКорреспонденции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетОтНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗакрытияСчетов</name>
    <type>
      <types>CatalogRef.ВариантыЗакрытияСчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетаУчета</name>
    <attributes>
      <name>ФиксированныйСчет</name>
      <type>
        <types>CatalogRef.ФиксированныеСчетаУчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Catalogs/ФиксированныеСчетаУчетаБД/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьИменаСубконто() Экспорт 

	Результат = Новый Структура;
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "Субконто1");
	Субконто.Вставить(2, "Субконто2");
	Субконто.Вставить(3, "Субконто3");
	
	Результат.Вставить("Счет", Субконто);
		
	Возврат Результат;
	
КонецФункции

Функция АналитикаФиксированногоСчета(ФиксированныйСчет = Неопределено, УчетнаяПолитика = Неопределено) Экспорт

	Таб = АналитикаФиксированныхСчетов(ФиксированныйСчет, УчетнаяПолитика);
	
	Если Таб.Количество() = 0 Тогда
		Таб.Добавить();//добавим пустую строку
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Таб.Получить(0));
	
КонецФункции

Функция АналитикаФиксированныхСчетов(ФиксированныеСчета = Неопределено, УчетнаяПолитика = Неопределено) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ФиксированныеСчетаУчетаБД.Ссылка КАК ФиксированныйСчет,
	|	ФиксированныеСчетаУчетаБД.Счет КАК СчетИБ,
	|	ФиксированныеСчетаУчетаБД.Счет.СчетСсылка КАК СчетСсылка,
	|	ФиксированныеСчетаУчетаБД.Субконто1 КАК Субконто1,
	|	ФиксированныеСчетаУчетаБД.Субконто2 КАК Субконто2,
	|	ФиксированныеСчетаУчетаБД.Субконто3 КАК Субконто3
	|ИЗ
	|	Справочник.ФиксированныеСчетаУчетаБД КАК ФиксированныеСчетаУчетаБД
	|ГДЕ
	|	ФиксированныеСчетаУчетаБД.Ссылка В(&ФиксированныеСчета)";
	
	Документы.УчетнаяПолитикаМСФО.ЗаменитьФиксированныеСчетаУчетаБД(ТекстЗапроса);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ФиксированныеСчета",	ФиксированныеСчета);
	Запрос.УстановитьПараметр("УчетнаяПолитика",	УчетнаяПолитика);//для УП
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область ОбновлениеПредопределенных

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов справочника.
//  ТабличныеЧасти - Структура из КлючИЗначение - данные заполнения табличных частей.
//                                                Состав колонок соответствует набору реквизитов табличных частей.
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВнеоборотныеАктивы";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Внеоборотные активы'", КодыЯзыков); // @NStr-2
	Элемент.Код = "008";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КонсолидационныеПоправки";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Консолидационные поправки'", КодыЯзыков); // @NStr-2
	Элемент.Код = "005";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НераспределеннаяПрибыль";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Нераспределенная прибыль'", КодыЯзыков); // @NStr-2
	Элемент.Код = "010";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОбщиеВспомогательныеСчета";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Общие вспомогательные счета'", КодыЯзыков); // @NStr-2
	Элемент.Код = "013";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтложенныеНалоги";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Отложенные налоги'", КодыЯзыков); // @NStr-2
	Элемент.Код = "028";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РезервыПоПретензиям";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Резервы по претензиям'", КодыЯзыков); // @NStr-2
	Элемент.Код = "034";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РеформацияБаланса";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Реформация баланса'", КодыЯзыков); // @NStr-2
	Элемент.Код = "038";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РеформацияСебестоимости";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Реформация себестоимости'", КодыЯзыков); // @NStr-2
	Элемент.Код = "037";
	
	// элементы	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОбщаяСебестоимость";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.РеформацияСебестоимости;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Общая себестоимость'", КодыЯзыков); // @NStr-2
	Элемент.Код = "042";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СебестоимостьПоСтатьям";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.РеформацияСебестоимости;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Себестоимость по статьям'", КодыЯзыков); // @NStr-2
	Элемент.Код = "043";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИзмененияОценкиЗапасов";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.РеформацияСебестоимости;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Изменения оценки запасов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "044";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РеклассЗатратВОПУ";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.РеформацияСебестоимости;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Рекласс затрат в ОПУ'", КодыЯзыков); // @NStr-2
	Элемент.Код = "045";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ТекущийФинансовыйРезультат";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.РеформацияБаланса;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Текущий финансовый результат'", КодыЯзыков); // @NStr-2
	Элемент.Код = "039";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВспомогательныйНачальныеОстаткиВНА";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.ВнеоборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Вспомогательный: начальные остатки ВНА'", КодыЯзыков); // @NStr-2
	Элемент.Код = "009";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИнвестицииВДочерниеПредприятия";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Инвестиции в дочерние предприятия'", КодыЯзыков); // @NStr-2
	Элемент.Код = "001";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Гудвилл";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Гудвилл'", КодыЯзыков); // @NStr-2
	Элемент.Код = "002";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НеконтролирующаяДоляУчастияПрошлыхЛет";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Неконтролирующая доля участия прошлых лет'", КодыЯзыков); // @NStr-2
	Элемент.Код = "003";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РезультатДокупкиПродажиДолейДочернихКомпаний";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Результат докупки / продажи долей дочерних предприятий'", КодыЯзыков); // @NStr-2
	Элемент.Код = "007";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДоходОтВыгоднойПокупки";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Доход от выгодной покупки (отрицательный гудвилл)'", КодыЯзыков); // @NStr-2
	Элемент.Код = "016";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НеконтролирующаяДоляУчастияОтчетногоПериода";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Неконтролирующая доля участия отчетного периода'", КодыЯзыков); // @NStr-2
	Элемент.Код = "017";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УбытокОтОбесцененияГудвилла";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Убыток от обесценения гудвилла'", КодыЯзыков); // @NStr-2
	Элемент.Код = "018";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИнвестицииВСовместныеПредприятия";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Инвестиции в совместные предприятия'", КодыЯзыков); // @NStr-2
	Элемент.Код = "019";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИнвестицииВАссоциированныеПредприятия";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Инвестиции в ассоциированнные предприятия'", КодыЯзыков); // @NStr-2
	Элемент.Код = "020";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДолиВПрибылиУбыткеАссоциированные";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Доля в прибыли/убытке от инвестиций в ассоциированные предприятия'", КодыЯзыков); // @NStr-2
	Элемент.Код = "021";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДолиВПрибылиУбыткеСовместные";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Доля в прибыли/убытке от инвестиций в совместные предприятия'", КодыЯзыков); // @NStr-2
	Элемент.Код = "022";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УбытокОтОбесцененияИнвестицийВАссоциированные";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Убыток от обесценения инвестиций в ассоциированные предприятия'", КодыЯзыков); // @NStr-2
	Элемент.Код = "023";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УбытокОтОбесцененияИнвестицийВСовместные";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Убыток от обесценения инвестиций в совместные предприятия'", КодыЯзыков); // @NStr-2
	Элемент.Код = "024";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НеконтролирующаяДоляУчастияПрочийСовокупныйДоход";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Неконтролирующая доля участия отчетного периода - прочий совокупный доход'", КодыЯзыков); // @NStr-2
	Элемент.Код = "025";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РезультатОтВыбытияДолейВДочернихПредприятиях";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Финансовый результат от выбытия долей в дочерних предприятиях (НСБУ)'", КодыЯзыков); // @NStr-2
	Элемент.Код = "026";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ТрансляционныйРезерв";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.КонсолидационныеПоправки;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Трансляционный резерв'", КодыЯзыков); // @NStr-2
	Элемент.Код = "027";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоПериода";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.НераспределеннаяПрибыль;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Нераспределенная прибыль / непокрытый убыток отчетного периода'", КодыЯзыков); // @NStr-2
	Элемент.Код = "011";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НераспределеннаяПрибыльНепокрытыйУбытокПредыдущихПериодов";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.НераспределеннаяПрибыль;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Нераспределенная прибыль / непокрытый убыток предыдущих периодов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "012";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВспомогательныйБалансовый";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.ОбщиеВспомогательныеСчета;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Вспомогательный балансовый'", КодыЯзыков); // @NStr-2
	Элемент.Код = "014";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВспомогательныйЗабалансовый";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.ОбщиеВспомогательныеСчета;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Вспомогательный забалансовый'", КодыЯзыков); // @NStr-2
	Элемент.Код = "015";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтложенныйНалоговыйАктив";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.ОтложенныеНалоги;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Отложенный налоговый актив'", КодыЯзыков); // @NStr-2
	Элемент.Код = "029";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтложенноеНалоговоеОбязательство";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.ОтложенныеНалоги;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Отложенное налоговое обязательство'", КодыЯзыков); // @NStr-2
	Элемент.Код = "030";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПостоянноеНалоговоеОбязательство";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.ОтложенныеНалоги;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Постоянное налоговое обязательство'", КодыЯзыков); // @NStr-2
	Элемент.Код = "031";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПостоянныйНалоговыйАктив";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.ОтложенныеНалоги;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Постоянный налоговый актив'", КодыЯзыков); // @NStr-2
	Элемент.Код = "032";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтложенныйНалогПоМСФО";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.ОтложенныеНалоги;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Отложенный налог по МСФО'", КодыЯзыков); // @NStr-2
	Элемент.Код = "033";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УсловныйНалогНаПрибыль";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.ОтложенныеНалоги;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Условный налог на прибыль'", КодыЯзыков); // @NStr-2
	Элемент.Код = "046";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтложенныйНалогПоНСБУ";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.ОтложенныеНалоги;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Отложенный налог по НСБУ'", КодыЯзыков); // @NStr-2
	Элемент.Код = "047";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НалогНаПрибыль";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.ОтложенныеНалоги;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Налог на прибыль'", КодыЯзыков); // @NStr-2
	Элемент.Код = "048";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетРасходаПоПретензиям";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.РезервыПоПретензиям;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет расхода по претензиям'", КодыЯзыков); // @NStr-2
	Элемент.Код = "035";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СчетРезерваПоПретензиям";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.РезервыПоПретензиям;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет резерва по претензиям'", КодыЯзыков); // @NStr-2
	Элемент.Код = "036";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЭффектГиперинфляции";
	Элемент.Родитель = Справочники.ФиксированныеСчетаУчетаБД.НераспределеннаяПрибыль;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Счет эффекта гиперинфляции'", КодыЯзыков); // @NStr-2
	Элемент.Код = "049";
	
КонецПроцедуры

// Вызывается при начальном заполнении создаваемого элемента.
//
// Параметры:
//  Объект                  - СправочникОбъект.НастройкиХозяйственныхОпераций - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения.
//  ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
